In [2]:
import numpy as np
import pandas as pd

In [3]:
sr = pd.Series([1,2,3,4,5,6])

In [4]:
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
sr1 = pd.Series(np.array([4,5,67,3,4]))

In [6]:
type(sr.values), type(sr1.values)

(numpy.ndarray, numpy.ndarray)

In [7]:
sr.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
sr.tail()

1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
sr.head(3)

0    1
1    2
2    3
dtype: int64

In [10]:
sr.size

6

In [11]:
sr.max()

np.int64(6)

In [12]:
sr.min()

np.int64(1)

In [13]:
sr.sum()

np.int64(21)

In [14]:
sr.mean()

np.float64(3.5)

In [15]:
sr.describe()

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [16]:
sr.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
data = pd.Series({'a':2,'b':3,'c':4,'d':5},name='alok')

In [18]:
data

a    2
b    3
c    4
d    5
Name: alok, dtype: int64

In [19]:
data.index, data.values

(Index(['a', 'b', 'c', 'd'], dtype='object'), array([2, 3, 4, 5]))

## DataFrame

In [20]:
student_dict = {
 'name':['peter','saint','noeum','parle','samme','dave'],
 'iq':[100,90,120,80,13,90],
 'marks':[80,70,100,50,11,80],
 'package':[10,7,14,2,15,100]
}

In [21]:
df = pd.DataFrame(student_dict)

In [22]:
df

    name   iq  marks  package
0  peter  100     80       10
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15
5   dave   90     80      100

In [23]:
df.head()

    name   iq  marks  package
0  peter  100     80       10
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15

In [24]:
df.tail()

    name   iq  marks  package
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15
5   dave   90     80      100

In [25]:
df.describe()

               iq       marks     package
count    6.000000    6.000000    6.000000
mean    82.166667   65.166667   24.666667
std     36.498858   31.115377   37.211109
min     13.000000   11.000000    2.000000
25%     82.500000   55.000000    7.750000
50%     90.000000   75.000000   12.000000
75%     97.500000   80.000000   14.750000
max    120.000000  100.000000  100.000000

In [27]:
df.value_counts()

name   iq   marks  package
dave   90   80     100        1
noeum  120  100    14         1
parle  80   50     2          1
peter  100  80     10         1
saint  90   70     7          1
samme  13   11     15         1
Name: count, dtype: int64

In [28]:
df.isna()

    name     iq  marks  package
0  False  False  False    False
1  False  False  False    False
2  False  False  False    False
3  False  False  False    False
4  False  False  False    False
5  False  False  False    False

In [29]:
df.isna().sum()

name       0
iq         0
marks      0
package    0
dtype: int64

In [48]:
df = pd.read_csv(r'D:\PreGrad\AL_ML\Session_1\Data\alzheimers_disease_patient_data.csv')

In [31]:
df.head()

,PatientID,Age,Gender,Ethnicity,EducationLevel,BMI,Smoking,AlcoholConsumption,PhysicalActivity,DietQuality,...,MemoryComplaints,BehavioralProblems,ADL,Confusion,Disorientation,PersonalityChanges,DifficultyCompletingTasks,Forgetfulness,Diagnosis,DoctorInCharge
0,4751,73,0,0,2,22.927749,0,13.297218,6.327112,1.347214,...,0,0,1.725883,0,0,0,1,0,0,XXXConfid
1,4752,89,0,0,0,26.827681,0,4.542524,7.619885,0.518767,...,0,0,2.592424,0,0,0,0,1,0,XXXConfid
2,4753,73,0,3,1,17.795882,0,19.555085,7.844988,1.826335,...,0,0,7.119548,0,1,0,1,0,0,XXXConfid
3,4754,74,1,0,1,33.800817,1,12.209266,8.428001,7.435604,...,0,1,6.481226,0,0,0,0,0,0,XXXConfid
4,4755,89,0,0,0,20.716974,0,18.454356,6.310461,0.795498,...,0,0,0.014691,0,0,1,1,0,0,XXXConfid

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2149 entries, 0 to 2148
Data columns (total 35 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   PatientID                  2149 non-null   int64
 1   Age                        2149 non-null   int64
 2   Gender                     2149 non-null   int64
 3   Ethnicity                  2149 non-null   int64
 4   EducationLevel             2149 non-null   int64
 5   BMI                        2149 non-null   float64
 6   Smoking                    2149 non-null   int64
 7   AlcoholConsumption         2149 non-null   float64
 8   PhysicalActivity           2149 non-null   float64
 9   DietQuality                2149 non-null   float64
 10  SleepQuality               2149 non-null   float64
 11  FamilyHistoryAlzheimers    2149 non-null   int64
 12  CardiovascularDisease      2149 non-null   int64
 13  Diabetes                   2149 non-null   int64
 14  Depression                 2149 non-null   int64
 15  HeadInjury                 2149 non-null   int64
 16  Hypertension               2149 non-null   int64
 17  SystolicBP                 2149 non-null   int64
 18  DiastolicBP                2149 non-null   int64
 19  CholesterolTotal           2149 non-null   float64
 20  CholesterolLDL             2149 non-null   float64
 21  CholesterolHDL             2149 non-null   float64
 22  CholesterolTriglycerides   2149 non-null   float64
 23  MMSE                       2149 non-null   float64
 24  FunctionalAssessment       2149 non-null   float64
 25  MemoryComplaints           2149 non-null   int64
 26  BehavioralProblems         2149 non-null   int64
 27  ADL                        2149 non-null   float64
 28  Confusion                  2149 non-null   int64
 29  Disorientation             2149 non-null   int64
 30  PersonalityChanges         2149 non-null   int64
 31  DifficultyCompletingTasks  2149 non-null   int64
 32  Forgetfulness              2149 non-null   int64
 33  Diagnosis                  2149 non-null   int64
 34  DoctorInCharge             2149 non-null   object
dtypes: float64(12), int64(22), object(1)
memory usage: 587.7+ KB

In [36]:
df['Diagnosis'].value_counts()

Diagnosis
0    1389
1     760
Name: count, dtype: int64

In [37]:
df= pd.read_csv(r'D:\PreGrad\AL_ML\Session_1\Data\imdb_movies.csv')

In [38]:
df.head()

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy","While working underground to fix a water main,...","Chris Pratt, Mario (voice), Anya Taylor-Joy, P...",The Super Mario Bros. Movie,Released,English,100000000.0,7.244590e+08,AU
3,Mummies,01/05/2023,70.0,"Animation, Comedy, Family, Adventure, Fantasy","Through a series of unfortunate events, three ...","Óscar Barberán, Thut (voice), Ana Esther Albor...",Momias,Released,"Spanish, Castilian",12300000.0,3.420000e+07,AU
4,Supercell,03/17/2023,61.0,Action,Good-hearted teenager William always lived in ...,"Skeet Ulrich, Roy Cameron, Anne Heche, Dr Quin...",Supercell,Released,English,77000000.0,3.409420e+08,US

In [39]:
df.count()

names         10178
date_x        10178
score         10178
genre         10093
overview      10178
crew          10122
orig_title    10178
status        10178
orig_lang     10178
budget_x      10178
revenue       10178
country       10178
dtype: int64

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10178 entries, 0 to 10177
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       10178 non-null  object
 1   date_x      10178 non-null  object
 2   score       10178 non-null  float64
 3   genre       10093 non-null  object
 4   overview    10178 non-null  object
 5   crew        10122 non-null  object
 6   orig_title  10178 non-null  object
 7   status      10178 non-null  object
 8   orig_lang   10178 non-null  object
 9   budget_x    10178 non-null  float64
 10  revenue     10178 non-null  float64
 11  country     10178 non-null  object
dtypes: float64(3), object(9)
memory usage: 954.3+ KB

In [41]:
df.columns

Index(['names', 'date_x', 'score', 'genre', 'overview', 'crew', 'orig_title',
       'status', 'orig_lang', 'budget_x', 'revenue', 'country'],
      dtype='object')

In [42]:
df.isna().sum()

names          0
date_x         0
score          0
genre         85
overview       0
crew          56
orig_title     0
status         0
orig_lang      0
budget_x       0
revenue        0
country        0
dtype: int64

In [43]:
df['country'].value_counts()

country
AU    4885
US    2750
JP     538
KR     361
FR     222
GB     174
ES     153
HK     125
IT     123
MX     105
CN      93
DE      88
CA      67
RU      52
PH      43
IN      43
AR      41
BR      38
TH      30
DK      24
PL      22
TR      20
NL      16
NO      16
CO      14
TW      13
ID      12
IE      11
SE       9
CL       9
BE       7
PE       7
GR       6
FI       6
SU       5
CH       5
UA       4
SG       4
ZA       3
HU       3
VN       3
IS       2
GT       2
PR       2
AT       2
UY       2
CZ       2
SK       2
IR       2
MY       2
DO       1
IL       1
BY       1
BO       1
MU       1
PY       1
LV       1
XC       1
PT       1
KH       1
Name: count, dtype: int64

In [44]:
df['orig_lang'].value_counts()

orig_lang
English                                7417
Japanese                                714
Spanish, Castilian                      397
Korean                                  388
French                                  285
Chinese                                 153
Cantonese                               145
Italian                                 142
German                                   93
Russian                                  66
Tagalog                                  43
Portuguese                               35
Thai                                     34
Norwegian                                29
Polish                                   26
Hindi                                    26
Danish                                   23
Dutch, Flemish                           22
Swedish                                  22
Turkish                                  22
Indonesian                               11
Malayalam                                 7
Finnish                                   6
Tamil                                     6
Greek                                     6
Telugu                                    6
Persian                                   5
Arabic                                    4
Ukrainian                                 4
Vietnamese                                4
No Language                               3
Icelandic                                 3
Catalan, Valencian                        2
Hungarian                                 2
Latvian                                   2
Malay                                     2
Bengali                                   2
Romanian                                  2
Central Khmer                             2
Czech                                     2
Kannada                                   2
Macedonian                                1
Marathi                                   1
Galician                                  1
Serbian                                   1
Oriya                                     1
Basque                                    1
Bokmål, Norwegian, Norwegian Bokmål       1
Irish                                     1
Gujarati                                  1
Serbo-Croatian                            1
Latin                                     1
Dzongkha                                  1
Slovak                                    1
Name: count, dtype: int64

In [45]:
df.size

122136

In [46]:
df.shape

(10178, 12)

122136